In [1]:
import pandas as pd
from sqlalchemy import create_engine
from getpass import getpass

### Storing CSV into DataFrame

In [2]:
csv_file = "Resources/AQI_data.csv"
AQI_data_df = pd.read_csv(csv_file)
AQI_data_df.head()

,Unnamed: 0,Date,State,Latitude,Longitude,AQI,CO,NO,NO2,O3,SO2,PM2_5,PM10,NH3,dt
0,0,2020-11-27 05:00:00,AK,63.588753,-154.493062,1,195.27,0.0,0.03,54.36,0.06,0.5,0.54,0.0,1606453200
1,1,2020-11-27 06:00:00,AK,63.588753,-154.493062,1,196.93,0.0,0.03,56.51,0.06,0.5,0.54,0.0,1606456800
2,2,2020-11-27 07:00:00,AK,63.588753,-154.493062,1,198.60,0.0,0.03,57.94,0.07,0.5,0.54,0.0,1606460400
3,3,2020-11-27 08:00:00,AK,63.588753,-154.493062,1,198.60,0.0,0.03,58.65,0.07,0.5,0.54,0.0,1606464000
4,4,2020-11-27 09:00:00,AK,63.588753,-154.493062,1,198.60,0.0,0.03,58.65,0.07,0.5,0.54,0.0,1606467600

### Saving different DataFrames

In [3]:
# Creating dataframe for state_data_table
state_data_table_df = AQI_data_df[['Date','State','Latitude',"Longitude"]]
state_data_table_df.head()

                  Date State   Latitude   Longitude
0  2020-11-27 05:00:00    AK  63.588753 -154.493062
1  2020-11-27 06:00:00    AK  63.588753 -154.493062
2  2020-11-27 07:00:00    AK  63.588753 -154.493062
3  2020-11-27 08:00:00    AK  63.588753 -154.493062
4  2020-11-27 09:00:00    AK  63.588753 -154.493062

In [4]:
# Creating dataframe for state_data_table
state_data_table_tst = AQI_data_df[['Date','State','Latitude',"Longitude"]].reset_index()
state_data_table_tst.head()

   index                 Date State   Latitude   Longitude
0      0  2020-11-27 05:00:00    AK  63.588753 -154.493062
1      1  2020-11-27 06:00:00    AK  63.588753 -154.493062
2      2  2020-11-27 07:00:00    AK  63.588753 -154.493062
3      3  2020-11-27 08:00:00    AK  63.588753 -154.493062
4      4  2020-11-27 09:00:00    AK  63.588753 -154.493062

In [5]:
# Creating dataframe for pollutents_data_table
pollutents_data_table_df = AQI_data_df[['Date','State','CO','NO','NO2','O3','SO2','PM2_5','PM10','NH3']]
pollutents_data_table_df.head()

                  Date State      CO   NO   NO2     O3   SO2  PM2_5  PM10  NH3
0  2020-11-27 05:00:00    AK  195.27  0.0  0.03  54.36  0.06    0.5  0.54  0.0
1  2020-11-27 06:00:00    AK  196.93  0.0  0.03  56.51  0.06    0.5  0.54  0.0
2  2020-11-27 07:00:00    AK  198.60  0.0  0.03  57.94  0.07    0.5  0.54  0.0
3  2020-11-27 08:00:00    AK  198.60  0.0  0.03  58.65  0.07    0.5  0.54  0.0
4  2020-11-27 09:00:00    AK  198.60  0.0  0.03  58.65  0.07    0.5  0.54  0.0

In [20]:
data = {'Name': ['Tom', 'Joseph', 'Krish', 'John'], 'Age': [20, 21, 19, 18]}

In [21]:
df=pd.DataFrame(data)
df.head()

     Name  Age
0     Tom   20
1  Joseph   21
2   Krish   19
3    John   18

In [22]:
# engine = create_engine('postgresql://postgres:elodie1756postgres9343%@database-1.cr0qbwwhutcx.us-east-2.rds.amazonaws.com:5432/postgres')

In [30]:
# df.to_sql(name='df_test',schema='schema_test', con=engine, chunksize=10, if_exists='replace')

### Connecting to AWS database

In [31]:
# Creating connection between AWS and PostgreSQL database using SQLAlchemy
import psycopg2
# password = getpass('Enter database password')
engine = create_engine('postgresql://postgres:elodie1756postgres9343%@database-1.cr0qbwwhutcx.us-east-2.rds.amazonaws.com:5432/postgres')

In [ ]:
# Creating a schema for state_data_table DF
engine.execute("""CREATE SCHEMA state_data_table_schema
CREATE TABLE state_data_table (
index INTEGER PRIMARY KEY,
Date TEXT,
State TEXT,
Latitude DOUBLE PRECISION,
Longitude DOUBLE PRECISION)""")

In [ ]:
# Creating the table from a DF
state_data_table_tst.to_sql(name='state_data_table',schema='state_data_table_schema',con=engine, chunksize=10,if_exists='replace')

In [ ]:
# # Creating state_data_table
# cursor.execute("""CREATE TABLE state_data_table(
# index INTEGER PRIMARY KEY,
# Date DATE,
# State text,
# Latitude INTEGER,
# Longitude INTEGER)""")
# connection.commit()

In [ ]:
# Loading data into Postgres table from DataFrame

In [ ]:
#

### Check for tables

In [ ]:
# engine.table_names()

In [ ]:
# Adding data into state_data_df
# state_data_table_tst.to_sql(name='state_data_table', con=engine, if_exists='append', index=False)

In [ ]:
# Reading data from state_data_df
# pd.read_sql_query('select * from state_data_table', con=engine).head()